In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = [['Adrian',20],['Bethany',23],['Chloe',41]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=int)
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [3]:
new_dict = {'name':['Tom','Jane','Steve','Lucy'],'Sales':[250,300,350,400]}
df_dict = pd.DataFrame(new_dict)
df_dict

    name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [4]:
df_dict_index = pd.DataFrame(new_dict, index=['rank1','rank2','rank3','rank4'])
df_dict_index

        name  Sales
rank1    Tom    250
rank2   Jane    300
rank3  Steve    350
rank4   Lucy    400

In [5]:
dict_list = [{'Name':'Tom','Sales':250},{'Name':'Jan','Sales':300},{'Name':'Steve','Sales':350}]
dict_list = pd.DataFrame(dict_list)
dict_list

    Name  Sales
0    Tom    250
1    Jan    300
2  Steve    350

In [6]:
east = pd.Series([1000,1200],index=['q1','q2'])
west = pd.Series([1500,1200,4000],index=['q1','q2','q3'])
east

q1    1000
q2    1200
dtype: int64

In [7]:
west

q1    1500
q2    1200
q3    4000
dtype: int64

In [8]:
df_region = pd.DataFrame({'East':east,'West':west}) 
df_region

      East  West
q1  1000.0  1500
q2  1200.0  1200
q3     NaN  4000

In [9]:
df_region['North'] = [2000,3000,1234] # adding column to a dataframe
df_region

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [12]:
df_region.fillna(0)

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     0.0  4000   1234

In [11]:
df_region.fillna(method='ffill')

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3  1200.0  4000   1234

In [13]:
df_region.dropna()

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000

In [16]:
df_region.dropna(axis=1,how='any')

    West  North
q1  1500   2000
q2  1200   3000
q3  4000   1234

In [18]:
df_dup = DataFrame([['A',1],['B',2],['A',1]])
df_dup

   0  1
0  A  1
1  B  2
2  A  1

In [19]:
df_dup.duplicated()

0    False
1    False
2     True
dtype: bool

In [20]:
df_dup.drop_duplicates(inplace=True) #changes the dataframe permanently
df_dup

   0  1
0  A  1
1  B  2

In [23]:
df_region

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [25]:
df_region['East']

q1    1000.0
q2    1200.0
q3       NaN
Name: East, dtype: float64

In [26]:
df_region.iloc[2] #returns the 3rd row

East        NaN
West     4000.0
North    1234.0
Name: q3, dtype: float64

In [27]:
df_region.iloc[0,1] #returns specific data using index coordinates (y = 0, x = 1)

1500

In [28]:
df_region.iloc[0:1] #slicing

      East  West  North
q1  1000.0  1500   2000

In [29]:
df_region.iloc[1:3]

      East  West  North
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [30]:
df_region.loc['q2'] #returns specific named row

East     1200.0
West     1200.0
North    3000.0
Name: q2, dtype: float64

In [32]:
df_region.loc[['q1','q3']] #can return multiple rows

      East  West  North
q1  1000.0  1500   2000
q3     NaN  4000   1234

In [33]:
df_region.loc[[False,True,False]]

      East  West  North
q2  1200.0  1200   3000

In [34]:
df_region[df_region['East']>1100]

      East  West  North
q2  1200.0  1200   3000

In [35]:
df_region['East']+df_region['West']

q1    2500.0
q2    2400.0
q3       NaN
dtype: float64

In [36]:
df_region.sum()

East     2200.0
West     6700.0
North    6234.0
dtype: float64

In [38]:
df_region.min()

East     1000.0
West     1200.0
North    1234.0
dtype: float64

In [40]:
df_region.mean()

East     1100.000000
West     2233.333333
North    2078.000000
dtype: float64